In [1]:
import pandas as pd
import pyarrow as pa
import pyarrow.parquet as pq
import numpy as np
import os

In [2]:
path = '../data/M5_full.parquet'

df = pd.read_parquet(path)

In [4]:
df.head(5)

,id,item_id,dept_id,cat_id,store_id,state_id,value,date
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,2011-01-29

In [5]:
df['date'] = pd.to_datetime(df['date'])
df['year_month'] = df['date'].dt.to_period('M')

### Fazendo série base (Receita mensal)

In [10]:
def make_total_income_series(df):
    df_total_income = df[['value', 'year_month']]
    df_total_income = df_total_income.groupby(['year_month'])['value'].sum().reset_index()

    output_dir = '../data'

    if not os.path.exists(output_dir):
        os.makedirs(output_dir)
        
    file_name = 'total_income_series.parquet'
    file_path = os.path.join(output_dir, file_name)

    table = pa.Table.from_pandas(df_total_income)
    pq.write_table(table, file_path)

In [11]:
make_total_income_series(df)

In [12]:
path_income = '../data/total_income_series.parquet'

df_income = pd.read_parquet(path_income)

In [13]:
df_income.head()

  year_month   value
0    2011-01   88163
1    2011-02  726375
2    2011-03  763567
3    2011-04  737713
4    2011-05  719562

### Fazendo série por estados

In [ ]:
# output_dir = '../data/parquet/rcbp'

# if not os.path.exists(output_dir):
#     os.makedirs(output_dir)

# for value in df['Nome do RCBP'].unique():
#     sub_df = df[df['Nome do RCBP'] == value]
    
#     file_name = f'{value}.parquet'
#     file_path = os.path.join(output_dir, file_name)
#     table = pa.Table.from_pandas(sub_df)
#     pq.write_table(table, file_path)